# Py-2021-CreditOne-POA-Student

Last update: 2021.12.13<br>
Student: Marlon Roa

## Import all required modules

In [1]:
# core
import numpy as np
import pandas as pd
import scipy
from math import sqrt
import matplotlib.pyplot as plt
import seaborn as sns

# sql
import sqlalchemy
from sqlalchemy import create_engine
import pymysql

# SKLearn
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score

# models
from sklearn.metrics import accuracy_score
from sklearn.metrics import classification_report, confusion_matrix
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.svm import SVC

# Task 1 - Getting Started

In [2]:
# import dataset
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
db_connection = create_engine(db_connection_str)
df = pd.read_sql('SELECT * FROM credit', con = db_connection)

In [3]:
df.shape

(30204, 25)

In [4]:
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [5]:
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204,...,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,89,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

## Preprocess dataset
### Steps to preprocess dataset
* Change col labels
* Sort
* Remove cols 
* Add NaNs and remove
* Remove duplicates
* Use iloc to create new ds
* Write/read csv

In [6]:
# rename col header (refer to article)
df.columns = df.iloc[0]
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [ ]:
# sort
df = df.sort_values('AGE', ascending=False)
df.head()

In [7]:
# remove rows with labels and col ID
df = df.iloc[3:,1:]
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
3,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
6,50000,male,graduate school,2,37,0,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,not default
7,500000,male,graduate school,2,29,0,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,not default

In [8]:
# replace missing values, other with NaN and then drop

df = df.replace(['','?'], np.nan)
df[df.isnull().values]
df = df.dropna()
df.isnull().values.any()

False

In [9]:
# remove any duplicates

df.duplicated().any()
df[df.duplicated()].shape
df = df.drop_duplicates()
df.duplicated().any()

False

In [10]:
# rename feature

df.rename(columns = {'default payment next month':'DEFAULT'}, inplace = True)

In [11]:
df.dtypes

0
LIMIT_BAL    object
SEX          object
EDUCATION    object
MARRIAGE     object
AGE          object
PAY_0        object
PAY_2        object
PAY_3        object
PAY_4        object
PAY_5        object
PAY_6        object
BILL_AMT1    object
BILL_AMT2    object
BILL_AMT3    object
BILL_AMT4    object
BILL_AMT5    object
BILL_AMT6    object
PAY_AMT1     object
PAY_AMT2     object
PAY_AMT3     object
PAY_AMT4     object
PAY_AMT5     object
PAY_AMT6     object
DEFAULT      object
dtype: object

In [12]:
# change data types by write/read csv

# write csv 
df.to_csv('dfOOB.csv', index=False)

In [13]:
# read csv
dfOOB = pd.read_csv('dfOOB.csv')

In [14]:
dfOOB.dtypes

LIMIT_BAL    object
SEX          object
EDUCATION    object
MARRIAGE     object
AGE          object
PAY_0        object
PAY_2        object
PAY_3        object
PAY_4        object
PAY_5        object
PAY_6        object
BILL_AMT1    object
BILL_AMT2    object
BILL_AMT3    object
BILL_AMT4    object
BILL_AMT5    object
BILL_AMT6    object
PAY_AMT1     object
PAY_AMT2     object
PAY_AMT3     object
PAY_AMT4     object
PAY_AMT5     object
PAY_AMT6     object
DEFAULT      object
dtype: object

# Task 2 - EDA

In [15]:
dfOOB.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29967 entries, 0 to 29966
Data columns (total 24 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   LIMIT_BAL  29967 non-null  object
 1   SEX        29967 non-null  object
 2   EDUCATION  29967 non-null  object
 3   MARRIAGE   29967 non-null  object
 4   AGE        29967 non-null  object
 5   PAY_0      29967 non-null  object
 6   PAY_2      29967 non-null  object
 7   PAY_3      29967 non-null  object
 8   PAY_4      29967 non-null  object
 9   PAY_5      29967 non-null  object
 10  PAY_6      29967 non-null  object
 11  BILL_AMT1  29967 non-null  object
 12  BILL_AMT2  29967 non-null  object
 13  BILL_AMT3  29967 non-null  object
 14  BILL_AMT4  29967 non-null  object
 15  BILL_AMT5  29967 non-null  object
 16  BILL_AMT6  29967 non-null  object
 17  PAY_AMT1   29967 non-null  object
 18  PAY_AMT2   29967 non-null  object
 19  PAY_AMT3   29967 non-null  object
 20  PAY_AMT4   29967 non-null  object
 21  PAY_AMT5   29967 non-null  object
 22  PAY_AMT6   29967 non-null  object
 23  DEFAULT    29967 non-null  object
dtypes: object(24)
memory usage: 5.5+ MB

In [ ]:
dfOOB.head()

### Statistics

In [ ]:
dfOOB.describe()

### Visualizations

#### Histograms

In [ ]:
# Plot using object data type

plt.hist(dfOOB['EDUCATION'])
plt.show()

In [ ]:
# Change data type to category and plot same as above.

dfOOB['EDUCATION'] = dfOOB['EDUCATION'].astype('category')
plt.hist(dfOOB['EDUCATION'])
plt.show()

In [ ]:
plt.hist(dfOOB['LIMIT_BAL'])
plt.show()

In [ ]:
plt.hist(dfOOB['LIMIT_BAL'], bins=4)
plt.show()

#### Line Plots

In [ ]:
plt.plot(dfOOB['LIMIT_BAL'])
plt.show()

#### Scatter Plots

In [ ]:
x = dfOOB['PAY_0']
y = dfOOB['PAY_2']
plt.scatter(x,y)
plt.show()

#### Box Plots

In [ ]:
# dfOOB.dtypes.index   # use code below I/O that in POA 
header = dfOOB.columns
print(header)

In [ ]:
A = dfOOB['BILL_AMT1']
plt.boxplot(A,0,'gD')
plt.show()

#### Homework: Other visualiations based on Titanic tutorial

## Feature Selection

For this task, you will not be selecting features.

#### Correlation

In [ ]:
corrMat = dfOOB.corr()
print(corrMat)

#### Covariance

In [ ]:
covMat = dfOOB.cov()
print(covMat)

# Task 3 - Modeling

## Prepare data

#### OOB ds

In [ ]:
# convert IV to dummy vars using get_dummies
oobX = pd.get_dummies(dfOOB.iloc[:,:-1])
oobX.dtypes

In [ ]:
# convert DV to dummy vars using LabelEncoder
le = LabelEncoder()
oobY = le.fit_transform(dfOOB['DEFAULT'])
oobY

## Split/Train/Test

In [ ]:
# OOB dataset

X_trainOOB, X_testOOB, y_trainOOB, y_testOOB = train_test_split(oobX, oobY)   
print( X_trainOOB.shape )
print( y_trainOOB.shape )
print( X_testOOB.shape )
print( y_testOOB.shape )

##  Create Models

In [ ]:
# select 3 classification algorithms 
# replace algo1/2/3 with your chosen algorithms

algos = []
algos.append(('algo1', algo1()))
algos.append(('algo2', algo2()))
algos.append(('algo3', algo3()))

In [ ]:
# build models

results = []
names = []

for name, model in algos:
    result = cross_val_score(model, X_trainOOB, y_trainOOB, cv=3)
    names.append(name)
    results.append(result)

In [ ]:
# evaluate results

for i in range(len(names)):
    print(names[i],results[i].mean())

## Validate

In [ ]:
# select best model(s) to tune and validate with the test set
# NOTE: tuning is optional for this task

bestAlgo = bestAlgo(n_jobs=4)
bestAlgoOOBpred = bestAlgo.fit(X_trainOOB, y_trainOOB).predict(X_testOOB)
print(classification_report(y_testOOB, bestAlgoOOBpred))
print(confusion_matrix(y_testOOB, bestAlgoOOBpred))

## Predict
* Predict the unknown DV for a separate dataset, if provided.